[
  {
    "large_category": "",
    "small_category": "",
    "overview": "プロジェクトマネージャ試験 （レベル４） シラバス",
    "required_knowledge": "",
    "required_skill": ""
  },
  {
    "large_category": "",
    "small_category": "1-2 個別システ ム化計画の承 認",
    "overview": "",
    "required_knowledge": "IT ストラテジスト（ST）が個別システム 化計画を審査・承認する組織（以下，承認 組織という）に提出し，個別システム化計 画の妥当性の審査を経て承認を得ることを 支援する。 計画の承認組織は，計画内容の組織の戦 略と目標に対する充足性を評価した上で， 組織にとっての予算の限度，組織が期待す る完了時期，適用する品質要求事項，資源 の利用可能量などを勘案し，必要に応じて 計画内容に対して何らかの制約又は条件を 加える可能性がある。ST が，設定された制 約が大きな支障とならないかどうかを判断 し，必要に応じて個別システム化計画の承 認組織と調整するが，その際に支援する。 変化に俊敏に適応して価値を創出するた めには，組織の枠にとらわれず活用できる 全ての専門知識及びスキルを結集してプロ ジェクトを推進する必要がある。このよう なプロジェクトの推進方法に関して承認組 織の理解と合意を得る必要がある。 この個別システム化計画は，プロジェク トフェーズの立ち上げプロセス群及び計画 プロセス群のプロセスに対する初期の要求 事項となって，後続のプロセスで段階的に 詳細化される。 個別システム化計画の承認組織の位置付 けと権限は，プロジェクトを立ち上げる組 織やプロジェクトの形態によって異なる。\n・ 組織の状況に関する基本的な知識\n・ 個別システム化計画の承認組織に関する 知識\n・ 組織の戦略と目標に関する知識\n・ ビジネスニーズとその経済性の評価に関 する基本的な知識\n・ プロジェクトの成果物に関する知識\n・ プロジェクトの推進に必要な専門知識及 びスキルに関する知識\n・ 要求事項に関する知識\n・ プレゼンテーション技法に関する基本的 な知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ 承認組織に個別システム化計画の内容を 説明する能力\n・ 個別システム化計画の内容の重点を論理 的に説明する能力\n・ プロジェクトに必要な専門知識及びスキ ルを承認組織に適切に説明する能力\n・ 組織の枠にとらわれず必要な専門知識及 びスキルをプロジェクトに結集すること を合理的に説明する能力\n・ 個別システム化計画の承認責任者や担当 者の質問の意味を理解して適切に回答す る能力\n・ 個別システム化計画の承認責任者や担当 者の指摘を的確に理解する能力\n・ 個別システム化計画の承認責任者や担当 者の求めた制約に対して代替案を作成す る能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "1-5 プロジェク トチームの編 成",
    "overview": "プロジェクトの完遂に必要な人的資源を 得るために，プロジェクトチームのメンバ ーの選定を全面的に管理するか又は選定に 参加する。その際，プロジェクトの成果物 を活用して顧客に価値を提供する作業を考 慮し，運用組織及び保守組織との協働の形 態を踏まえたメンバーを選定する。 いつ，どのようにプロジェクトチームの メンバーを得て，いつ，どのようにメンバ ーをプロジェクトチームから解放するのか を決定する。 プロジェクトチームの編成においては， 専門知識及びスキル，個性の相違，チーム ワークによるパフォーマンス向上の効果な どの要因を考慮する必要がある。DX などの 環境の変化に俊敏に適応するためには，必 要な専門知識及びスキルを結集するため に，組織の枠にとらわれない組織横断チー ムによる活動が必要となる。組織内で人的 資源が得られないときは，追加のメンバー を雇うか，作業を別の組織に委託すること を考慮する。したがって，組織横断チーム には顧客又は外部の組織のメンバーが加わ ることがある。また，システム開発アプロ ーチに適合したプロジェクトチームのメン バー数を設定する。",
    "required_knowledge": "・ プロジェクト計画に関する知識\n・ プロジェクトの組織図に関する知識\n・ 資源要求事項に関する知識\n・ 先行割当てに関する知識\n・ 資源の利用可能性に関する知識\n・ 役割規定書に関する知識\n・ プロジェクトチームの作業場所に関する 知識\n・ プロジェクトチームの役割及び責任に関 する知識\n・ プロジェクトチームの報告及びコミュニ ケーションに対する要求事項に関する知 識\n・ メンバーの専門知識及びスキル，個性の 相違に関する知識\n・ リーダーシップ，動機付けなどの組織に おける人間関係のスキルに関する基本的 な知識\n・ チームワークによるパフォーマンス向上 の効果に関する知識\n・ 組織の個人のスキル情報に関する知識\n・ 組織の各部門がもつ専門知識及びスキル に関する知識\n・ 組織横断型のチームのメンバーの選定に 関する知識\n・ チームのメンバー数を決定する要素に関 する知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ メンバーの選定を管理する能力\n・ 先行割当てされたメンバーを評価する能 力\n・ 作業場所，チーム内の約束事項，役割及 び責任並びに報告及びコミュニケーショ ンに対する要求事項を識別する能力\n・ プロジェクトの目的の実現に必要な知識 及びスキルを識別する能力\n・ メンバー候補に要求される能力，資質， 適性などの要件を設定する能力\n・ メンバー候補の個性の相違，専門知識及 びスキルの相違を識別する能力\n・ メンバー候補の能力，資質，適性を評価 してメンバーを選定する能力\n・ チームワークによるパフォーマンス向上 の効果を考慮してチームを編成する能力\n・ 組織の枠を超えて必要なメンバーを選定 する能力\n・ システム開発アプローチに適合したメン バー数を設定する能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "2-2 システム開 発アプローチ の選択",
    "overview": "",
    "required_knowledge": "プロジェクトの目標及び要求事項を満た すための成果物の開発計画並びに実装に適 応するためのシステム開発アプローチを選 択して，これに対応した適切なプロジェク トフェーズの設定及び適切なプロジェクト マネジメントのプロセスの修整ができるよ うにする。 システム開発アプローチの選択において は，開発対象システムの特徴，予算，スケ ジュール，作業効率及び品質を考慮し，開 発対象システムに適合するシステム開発ラ イフサイクル，システム開発手法，開発環 境，品質保証・構成管理・文書化などの開 発標準を決定する。さらに，システムを運 用及び保守して顧客に価値を提供するリリ ース作業に関わるシステム開発プロジェク トの範囲を決める必要がある。その上で， システム開発とリリースのサイクルを設定 すること，このサイクルを迅速に繰り返す ために，開発・リリースにおける自動化を 促進することも必要となる。",
    "required_skill": "・ プロジェクトの目標及び要求事項に関す る知識\n・ 開発アプローチに影響する要素（要求事 項の不確かさ，変化への適応の俊敏さ， 制約，リスク，組織の経験・能力など） に関する知識\n・ システム開発アプローチの類型（予測型 （ウォーターフォール型），反復型，漸 増型，適応型（アジャイル型）など）に 関する知識\n・ アジャイル（スクラム，XPなど）， DevOpsなどのシステム開発手法に関する 知識\n・ 顧客に価値を提供する作業に関する知識\n・ プロジェクトマネジメントのプロセスの 修整に関する知識\n・ 組織の成果物の引渡しの作業，引渡しの 手続に関する知識\n・ システム開発環境に関する知識\n・ システム開発及びシステムのリリースに おける自動化（継続的インテグレーショ ン，継続的デリバリー，継続的デプロイ メント）に関する知識\n・ システム開発に関する国際標準，国内標 準，組織標準に関する知識\n・ システムの品質に関する知識\n・ 構成管理に関する知識\n・ 対話及び文書化に関する知識\n・ 開発対象システムの特徴を把握する能力\n・ 顧客に価値を提供する上で最適な開発ア プローチを選択する能力\n・ 開発アプローチに影響する要素を識別 し，適切な開発アプローチを選択する能 力\n・ 選択した開発アプローチに適したプロジ ェクトライフサイクルを設定する能力\n・ プロジェクトの目標及び要求事項を満た すための成果物の開発計画を作成する能 力\n・ プロジェクトの目標及び要求事項を満た すための成果物の実装に適応した開発手 法を設定する能力\n・ 開発アプローチに対応したプロジェクト フェーズを設定する能力\n・ プロジェクトの特徴に適合した開発標準 を選定する能力\n・ 開発対象システムの課題の最適な解決方 針を示す能力\n・ 顧客への価値提供に至る作業を識別して システム開発の範囲を設定する能力\n・ システム開発及びシステムのリリースに おける自動化の適用を判断する能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "2-4 WBSの作成",
    "overview": "プロジェクト計画や要求事項に基づき， 階層的に分割する手法でプロジェクトの目 標を達成するために必要な作業を特定す る。 ワークブレークダウンストラクチャ （WBS）は，プロジェクトフェーズで実施す る作業を，成果物に基づき，管理しやすい より小さな作業に階層的に分割して作成す る。 分割した WBS の最下位のレベルに定義さ れる作業であるワークパッケージ（WP）ご とに，作業内容，成果物を設定する。WBS， WP，スコープ規定書をスコープベースライ ンとする。 計画時点で作成する予定の全ての成果物 が確定できず，全ての作業を WP にまで分割 できない場合は，成果物が確定されてから 段階的に詳細な WBS を作成する。プロジェ クトの成果物，組織，リスク，コストなど に対して，それぞれ管理する目的に沿って 階層構造のブレークダウンストラクチャが 作成される。",
    "required_knowledge": "・ プロジェクト作業の構造に関する知識\n・ 階層的な分割に関する知識\n・ プロジェクトライフサイクル及びプロジ ェクトフェーズに関する知識\n・ 階層的な分割に関する知識\n・ WBSの段階的な詳細化に関する知識\n・ 組織ブレークダウンストラクチャ (OBS:Organization Breakdown Structure )に関する知識\n・リスクブレークダウンストラクチャ （RBS:Risk Breakdown Structure）に関 する知識\n・コストブレークダウンストラクチャ （CBS:Cost Breakdown Structure）に関 する知識\n・対話及び文書化に関する知識",
    "required_skill": "・ プロジェクト作業を，成果物に基づき， 管理しやすいより小さな作業に階層的に 分割する能力\n・ 成果物の確定の状況に適合した階層的な 分割の手法を適用する能力\n・ WBSを段階的に詳細化する能力\n・ WPを設定する能力\n・ WPごとに作業内容や成果物を設定する能 力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "2-6 資源の見積 り",
    "overview": "活動リストの活動ごとに必要なメンバ ー，施設，サービス，インフラストラクチ ャ，ツールなどの資源を見積もって決定す る。初期段階で資源の見積りの精度が低 く，ステークホルダとの合意が困難な場合 には，プロジェクトの進捗によって段階的 な見積りで精度向上やステークホルダとの 合意を図るようにする。この対応のために 見積り手法を初期は簡易なものとし，段階 的に精度の高い手法に変えていくことがあ る。 次いで，各資源について適切な投入時期 と投入量を決定し，資源計画を作成する。",
    "required_knowledge": "・ プロジェクトに必要なメンバー，施設， サービス，インフラストラクチャに関す る知識\n・ システム開発環境，ツールに関する知識\n・ プロジェクトマネジメントに必要なスキ ルに関する知識\n・ プロジェクトの作業量見積り，パフォー マンス，工数見積りに関する知識\n・ 見積り精度の段階的な向上に関する知識\n・ 見積りの手法の精度に関する知識\n・ 資源計画の作成を支援するシステムに関 する知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ 活動別に必要な資源を識別する能力\n・ 活動別に必要な資源を見積もる能力\n・ 活動別に必要な資源の割当てを行う能力\n・ 効率的な資源の投入時期と投入量を設定 する能力\n・ プロジェクトの遂行に必要な見積り精度 を識別する能力\n・ 見積り結果を段階的にステークホルダと 合意する能力\n・ プロジェクトの進捗に伴って必要な精度 の見積り手法を適用する能力\n・ 資源投入に伴うリスクを特定する能力\n・ 資源計画をステークホルダに合理的に説 明する能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "2-8 活動の順序 付け",
    "overview": "プロジェクトの活動間の論理的な関係を 特定し，活動順序を作成する。 プロジェクト内の全ての活動は，ネット ワーク図（作業工程図）を用いるなどし て，クリティカルパスや適切な予備を決定 できるように関係を明らかにする。 活動は，現実的かつ達成可能なプロジェ クトのスケジュールの作成のために，先行 作業との適正な依存関係及び適正なリー ド，ラグ，制約，相互依存関係並びに外部 との依存関係をもって論理的に順序付けす る。",
    "required_knowledge": "・ プロジェクト活動の論理的な関係に関す る知識\n・ プロジェクト活動のネットワーク図に関 する知識\n・ クリティカルパスや予備に関する知識\n・ 先行作業との依存関係，リード，ラグ， 制約，相互依存関係並びに外部との依存 関係に関する知識\n・ スケジュールの作成を支援するシステム に関する知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ プロジェクト全体の作業の順序関係を描 く能力\n・ 活動間の関係を図式化して分析する能力\n・ クリティカルパスを決定する能力\n・ 適切なリード，ラグ，制約，予備を設定 する能力\n・ 論理的及び物理的な条件を満たすように 活動を順序付ける能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "2-10 スケジュ ールの作成",
    "overview": "プロジェクトの活動の開始時間及び終了 時間を算定し，マイルストーンを設定し て，プロジェクト全体のスケジュールのベ ースラインを確定する。プロジェクトの環 境の急激な変化や高い不確かさなどでプロ ジェクト全体を通したスケジュールの作成 が難しい場合は，優先順位の高い要求事項 に関わる活動のスケジュールを作成し，要 求事項が確定するに伴って，段階的に該当 する活動を定義してスケジュールの作成を 行う必要がある。 スケジュールは，時間を基準とした実際 の進捗を評価する手段である。進捗を測る 尺度は，成果物の開発によって創出される 価値とするなど，プロジェクトの特徴に合 わせて設定する。 スケジュールの作成は，作業の進捗，プ ロジェクト計画の変更，予期するリスクの 発生又は消失，及び新しいリスクの特定に 応じて，プロジェクトを通じて継続して実 施する。また，プロジェクトの環境の変化 への適応力や不確さに対する回復力に基づ き設定する余裕を考慮し，更に論理的に可 能な実施期間の短縮，資源平準化を図り， スケジュールを作成する。",
    "required_knowledge": "・ プロジェクト作業の構造に関する知識\n・ 活動の相互依存関係に関する知識\n・ マイルストーンに関する知識\n・ スケジュールベースラインに関する知識\n・ プロジェクトの環境の変化や不確かさが スケジュールに与える影響に関する知識\n・ 要求事項の優先順位に関する知識\n・ 要求事項の段階的な確定に関する知識\n・ 活動の達成の評価尺度に関する知識\n・ 時間を基準とした進捗の評価に関する知 識\n・ 進捗を測る尺度に関する知識\n・ 価値創出の枠組みに関する知識\n・ 資源の平準化に関する知識\n・ プロジェクト計画の変更に関する知識\n・ リスクの発生と消失に関する知識\n・ 新しいリスクの特定に関する知識\n・ スケジュールのレビューに関する知識\n・ スケジュールの作成を支援するシステム に関する知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ プロジェクト全体の作業の順序関係を描 く能力\n・ 論理的な順序に基づいて活動をスケジュ ールする能力\n・ プロジェクトのマイルストーンを設定す る能力\n・ 制約を考慮してスケジュールを作成する 能力\n・ スコープや要求事項の優先順位を識別し てスケジュールを作成する能力\n・ 時間を基準とする進捗の評価の仕組みを 構築する能力\n・ プロジェクトの特徴に適合した進捗を測 る尺度を設定する能力\n・ スケジュールの作成に影響する対象を識 別し，これらを考慮してスケジュールを 改訂する能力\n・ プロジェクトの環境の変化への適応力や 不確かさに対する回復力がスケジュール に与える影響に考慮して余裕を設定する 能力\n・ スケジュールリスクを考慮する能力\n・ スケジュールをステークホルダに合理的 に説明する能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "2-14 リスクの評 価",
    "overview": "今後の処置のために，特定した各リスク の発生確率及びそのリスクが発生した場合 にプロジェクトの目標の達成に与える影響 を推定する。さらに，予算，スケジュー ル，主要なステークホルダのリスク許容度 などのほかの要因を考慮した評価に従って リスクへの対応の優先順位を定める。 リスクの評価は反復的なプロセスであ る。",
    "required_knowledge": "・ リスクの発生確率に関する知識\n・ リスクの発生が与える影響に関する知識\n・ 定性的リスク分析手法に関する知識\n・ 定量的リスク分析手法に関する知識\n・ リスクの許容度に関する知識\n・ リスクへの対応の優先順位付けに関する 知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ リスクの発生確率を推定する能力\n・ リスクの影響度を予測し，その結果を評 価する能力\n・ 全ての要因を考慮してリスクへの対応の 優先順位付けをする能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "2-17 コミュニ ケーションの 計画",
    "overview": "ステークホルダの関与を維持するために コミュニケーションを活用する。また，双 方向のコミュニケーションを通じて，信頼 関係を構築する。また情報のニーズ及び全 ての法令要求に従った情報のニーズを特定 する。また，そのニーズを満たすための適 切な手段を明確にする。プロジェクトの環 境の急激な変化や高い不確かさが想定され る場合は，変化する状況をより頻繁かつ迅 速に伝えるというコミュニケーションに対 する要求事項がある。 地理的に分散したメンバー，多様な文化 などの要因及び組織的要因は，コミュニケ ーションに対する要求事項に重要な影響を 与える。 コミュニケーションの計画は，ステーク ホルダの特定及び分析に続いて，また，定 期的にレビューし，プロジェクトを通じて 継続的に有効性を確保する。",
    "required_knowledge": "・ ステークホルダの特定，関与度及び影響 度に関する知識\n・ プロジェクトの環境の変化や不確かさが コミュニケーションに与える影響に関す る知識\n・ ステークホルダの情報のニーズに関する 知識\n・ ステークホルダのコミュニケーションに 対する要求事項に関する知識\n・ 情報の配布の形式と手段（対話，対面で の会議，非公式な打合せ，情報共有の仕 組みづくりなど）に関する知識\n・ プロジェクトの伝達事項に関する知識\n・ 迅速なコミュニケーションを実現する方 法に関する知識\n・ 会議体などのプロジェクトのコミュニケ ーションの方法に関する知識\n・ コミュニケーションに対する要求事項に 影響を与える要因に関する知識\n・ 法令の要求に関する基本的な知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ ステークホルダの情報のニーズを適切に 分析してプロジェクトへの影響を評価す る能力\n・ コミュニケーションに対する要求事項を 把握して対応方法を計画する能力\n・ コミュニケーションに対する要求事項に 沿ったプロジェクトの伝達事項を特定す る能力\n・ コミュニケーションに対する要求事項を 満たすための適切な手段を明確化する能 力\n・ コミュニケーションに対する要求事項に 影響を与える要因を識別する能力\n・ プロジェクト組織の外部も含めて，適切 な参加者で会議体を設定する能力\n・ プロジェクトを通じてコミュニケーショ ンの計画の有効性を確保する能力\n・ 法令の要求を認識して適切に対応する能 力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "3-3 プロジェク トチームの開 発",
    "overview": "",
    "required_knowledge": "継続的にプロジェクトチームのメンバー のパフォーマンス及び相互関係を改善し， プロジェクトチームの意識を統一して，活 力と主体性のあるプロジェクトチームを開 発する。さらに，プロジェクトチームとチ ームメンバーのパフォーマンス及び相互関 係を改善するように必要な教育・訓練にコ ストと時間を投入する。また，チームメン バーの心身の健康を管理する。 チームとしてパフォーマンスを継続して 改善するためには，個々のメンバーが得意 分野をもち，かつ広い範囲の作業がこなせ るように育成する必要がある。これによっ てメンバーは，チームのパフォーマンスを 向上させるスキルをもち，相互信頼をベー スとして自律的にプロジェクトをマネジメ ントできるようになる。また，顧客に価値 を提供するために必要となる全てのスキル を一つのチーム内に備えることを目指すこ とも必要になる。 適切な行動の基本原則を，プロジェクト の早い時期に確立することで，誤解を最小 限に，また対立を適切な範囲にとどめるこ とができる。\n・ プロジェクトチームメンバーのパフォー マンス及び相互関係に関する知識\n・ チームのパフォーマンスを向上させるス キルに関する知識\n・ チームの自律的なマネジメントに関する 知識\n・ 相互信頼とチームワークに関する知識\n・ 顧客への価値提供に必要となるスキルに 関する知識\n・ プロジェクトチームのコンピテンシーに 関する知識\n・ プロジェクト作業において使用する各種 の組織運営スキルに関する知識\n・ プロジェクトチームの育成モデルに関す る知識（タックマンモデルなど）\n・ チームメンバーの動機付けに関する知識\n・ チームメンバーの教育・訓練などのメン バー育成に関する知識\n・ 健康管理に関する基本的な知識\n・ 相互理解や共感がチームのパフォーマン スに与える影響に関する知識\n・ 相互理解，共感，対立，誤解などがチー ムのパフォーマンスに与える影響に関す る知識\n・ 労働基準法など労務管理に関する基本的 な知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ チームメンバー，チームのパフォーマン スを適切に評価する能力\n・ プロジェクトチームのパフォーマンスを 改善するために必要なスキルを識別する 能力\n・ メンバーの得意分野と作業範囲のバラン スが取れたチームを編成する能力\n・ メンバー間の相互信頼を高める能力\n・ チームの自律的なマネジメントを促進す る能力\n・ 顧客に価値を提供するために必要なスキ ルを識別する能力\n・ プロジェクトチームやチームメンバーを 目標の達成に向けて促し，支援する能力\n・ メンバーを支援してスキル不足を改善す る能力\n・ チームのパフォーマンス向上策を立案す る能力\n・ チームの活力と主体性を維持・向上する 能力\n・ 継続的にチームメンバーの動機付けを図 る能力\n・ チームのコンピテンシーを理解して行動 の基本原則を確立する能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "3-6 供給者の選 定",
    "overview": "システム開発メンバー，製品，サービス を外部の組織から調達する際に，供給者か ら情報を入手して，提出された全ての情報 をレビューし，審査して，プロジェクトの 条件に最適な供給者を選定する。 調達仕様書，要求事項に照らして契約の 種類，検収条件を確定し，契約書又は注文 書，及び選定された推奨供給者リストを作 成する。 情報提供，提案，応札又は契約条件の提 示に関する依頼はそれぞれの目的が異なる が，依頼には，目的及び提出期限ととも に，提供される文書のスコープ，体裁，品 質，数量などの詳細な説明を含める。 各供給者の応札の評価は，選択した評価 基準に従って実施し，最も適切かつ有益な 応札とみなせるものを最終的に選択する。 供給者の選定から最終契約条件を合意す るまでに，供給者に対しては双方のリスク を抑制する姿勢で契約交渉を行う。",
    "required_knowledge": "・ システム開発取引や契約に関する知識\n・ システム開発企業やサービス提供企業な どの供給者に関する知識\n・ システム開発メンバーに関する知識\n・ 製品に関する知識\n・ サービスの活用に関する知識\n・ サービスレベル合意書（SLA）に関する 知識\n・ 調達仕様書に関する知識\n・ 契約交渉に関する基本的な知識\n・ 検収条件に関する知識\n・ 情報提供，提案，応札及び契約条件に関 する知識\n・ 提案依頼書（RFP）に関する知識\n・ 組織の供給者選定の評価基準に関する知 識\n・ 調達のリスクに関する知識\n・ 法的制約に関する基本的な知識\n・ 守秘義務に関する基本的な知識\n・ 知的財産権に関する基本的な知識\n・ 海外調達に関する基本的な知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ 供給者からの調達品の合目的性，品質を 評価する能力\n・ 納入された調達品が調達仕様書に適合し ているかどうかの検収条件を設定する能 力\n・ 目的に対して適切な依頼をする能力\n・ 供給者を選定の評価基準に沿って評価し て最適な供給者を選定する能力\n・ 応札において選定される供給者に足る十 分な情報を提供する能力\n・ 調達の契約を交渉する能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "4-3 スコープの 管理",
    "overview": "スコープの変更によって生じる，プロジ ェクトの目標の達成にプラスとなることが ある潜在的リスク（機会）の影響を最大化 し，マイナスとなることがある潜在的リス ク（脅威）の影響を最小化して，スコープ ベースラインへの変更をマネジメントす る。 承認されたスコープのベースラインと現 在のスコープを比較して，今後のスコープ を予測して，スコープへの脅威となる影響 を抑えるために，全ての適切な変更要求を 実行する。 変更が頻発する場合には，要求事項の収 集，スコープの定義，WBSの作成，スコープ の検証，スコープの管理が迅速に繰り返さ れるように対応する。この繰返しの過程 で，要求事項の安定性を高めて要求事項の 優先順位付けを見直す。 脅威がプロジェクトへの影響が少ないも のであれば，スコープ内の問題として対応 策を考え，そのために必要な作業量や資源 を見積もり，影響度を見極めて問題を解決 する。 脅威が計画変更を必要とするものであれ ば，定められた変更管理の手続に従って適 切な変更要求をして，ステークホルダの承 認を得てスコープの変更を実施する。",
    "required_knowledge": "・ スコープのベースラインに関する知識\n・ スコープの変更の影響の査定に関する知 識\n・ スコープの変更をもたらす要因に関する 知識\n・ 頻繁な変更がスコープの管理に与える影 響に関する知識\n・ スコープの検証に関する知識\n・ 要求事項の安定性に関する知識\n・ 要求事項の優先順位に関する知識\n・ スコープの変更要求の手順やスコープの 変更の管理に関する知識\n・ スコープの変更によるリスクに関する知 識\n・ スコープの変更に必要な作業，資源に関 する知識\n・ 変更の管理に関する知識\n・ スコープの変更の予測に関する知識\n・ スコープのクリープに関する知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ スコープの変更に関連する全ての変更の 影響を管理する能力\n・ 機会となるスコープの変更のプラスの影 響を生かすために，適切な変更要求を実 施する能力\n・ 脅威となるスコープの変更のマイナスの 影響を抑えるために適切な変更要求を実 施する能力\n・ 要求されたスコープの変更の重要度を判 断する能力\n・ スコープの変更がプロジェクトに与える 影響度を査定する能力\n・スコープの変更に必要な作業量，資源量 を見積もる能力\n・ スコープのベースラインと現在のスコー プを比較してスコープの変更を予測する 能力\n・ スコープの検証の結果を要求事項の安定 化と優先順位付けに生かす能力\n・ 定められた基準に従って要求事項の優先 順位付けをする能力\n・ スコープの変更をステークホルダに合理 的に説明して承認を得る能力\n・スコープのクリープに対する予防処置を 実施する能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "4-6 スケジュー ルの管理",
    "overview": "一定期間内に投入したコストや資源，成 果物の出来高と品質などを評価し，承認済 みのスケジュールベースラインに対する現 在の進捗の実績を確認する。スケジュール の差異を監視して適切な処置をとる。 プロジェクトの完了に向けての見通しを 立て，遅れが生じている場合，完了期日を 予測してメンバーや資源の追加，スケジュ ールの変更などの対策を立案する。完了の スケジュール予測は，過去の傾向及び現状 の知識に基づいて定期的に作成し，必要に 応じて更新する。システムを頻繁にリリー スする場合は，顧客の満足度の評価状況に 基づいて，今後開発が必要な要求事項から 最終的なリリースまでの時間を判断して， 完了のスケジュールを予測する。 対策を基にコストや完了時期を再評価 し，必要に応じて上層の管理者の承認を得 てスケジュールベースラインを変更する。",
    "required_knowledge": "・ 進捗データに関する知識\n・ スケジュールパフォーマンスに関する知 識\n・ EVMに関する知識\n・ スケジュールの差異の監視に関する知識\n・ 成果物の出来高と品質の評価に関する知 識\n・ 活動の完了期日の予測に関する知識\n・ プロジェクトの完了期日の予測方法に関 する知識\n・ スケジュールの短縮技法に関する知識\n・ 変更管理手順に関する知識\n・ 頻繁なシステムのリリースがスケジュー ルの管理に与える影響に関する知識\n・ 顧客の満足度の評価に関する知識\n・ スケジュールの管理を支援するシステム に関する知識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ 部分的な進捗遅延によるプロジェクトへ の影響を推定する能力\n・ アンバランスな進捗に対して全体バラン スを回復させる能力\n・ 進捗遅延の原因を分析して対策を立案す る能力\n・ 進捗遅延に対してメンバーや資源の追加 を計画し実行する能力\n・ 進捗遅延に対して代替スケジュールを作 成する能力\n・ 完了期日を予測する能力\n・ 顧客の満足度の評価状況に基づいて，今 後開発が必要な要求事項を調整する能力\n・ 要求事項から開発に必要な時間を予測す る能力\n・ スケジュールベースラインの変更につい てステークホルダに合理的に説明して承 認を得る能力\n・ 対話によって相互理解を深める能力"
  },
  {
    "large_category": "",
    "small_category": "4-11 コミュニケ ーションのマ ネジメント",
    "overview": "ステークホルダのコミュニケーションに 対する要求事項を確実に満たし，コミュニ ケーションの課題が発生したときには，そ れを解決する。プロジェクトチームのメン バーとステークホルダの円滑なコミュニケ ーションを通じて，ステークホルダの理解 と協力を深める。頻繁な変更がある場合に は，これによってコミュニケーションのギ ャップが生まれないように，また変更に伴 い発生したコミュニケーションの課題につ いても迅速に解決できるように対応する必 要がある。 タイムリで正確で偏りのない情報を提供 し，コミュニケーションの課題を解決し て，未知又は未解決のステークホルダの課 題又は誤解によって，プロジェクトが悪影 響を受けるリスクを最小化する。 ■プロジェクトマネージャ試験（レベル4） シラバス（Ver.7.1）",
    "required_knowledge": "・ プロジェクトで報告すべき項目に関する 知識\n・ 情報の配布に関する知識\n・ ステークホルダのコミュニケーションに 対する要求事項に関する知識\n・ 頻繁な変更がコミュニケーションのマネ ジメントに与える影響に関する知識\n・ コミュニケ―ションのギャップに関する 知識\n・ コミュニケーションの課題の影響分析， 解決に関する知識\n・ プロジェクトチームのメンバーとステー クホルダの意思疎通に関する知識\n・ コミュニケーションに関わるリスクに関 する知識\n・ 内部統制に対応した報告と文書化の基本 的な知識\n・ プレゼンテーションに関する基本的な知 識\n・ 対話及び文書化に関する知識",
    "required_skill": "・ ステークホルダのコミュニケーションに 対する要求事項及び期待を適切に理解し て的確な対応を行う能力\n・ プロジェクトの状況を，正確かつ適切 に，重点事項を漏らさず報告する能力\n・ コミュニケーションの課題を的確に捉え て解決する能力\n・ コミュニケーションのギャップの発生を 予防する能力\n・ コミュニケーションのギャップを識別し て対処する能力\n・ 適切なコミュニケーションによってリス クを特定して対応する能力\n・ コミュニケーションのマネジメントの有 効性を評価する能力\n・ 対話によって相互理解を深める能力"
  }
]