[
  {
    "large_category": "",
    "small_category": "1-2 情報セキュリティリスクアセスメント",
    "overview": "",
    "required_knowledge": "リスク基準の確立及び維持について，必要な指導・助言を行い，支援する。リスク特定，リスク分析，リスク評価のプロセスの実施について，必要な指導・助言を行い，支援する。\n・ 情報の特性（機密性，完全性，可用性，真正性，責任追跡性，否認防止，信頼性など）に関する知識ぜい\n・ リスク，リスク基準，リスク源，脆弱性及び脅威に関する知識\n・ 情報セキュリティリスクアセスメントのプロセス（特定，分析，評価）に関する知識\n・ 脅威分析（STRIDE分析，アタックツリー分析（ATA）など）に関する知識",
    "required_skill": "・ 情報資産損失の大きさ（失われる資産の価値，原因究明及び復旧の費用，社会的説明の費用）を算定し，評価する能力\n・ リスク源，脆弱性及び脅威を，新たなITに関するものも含めて列挙する能力\n・ 情報資産とリスクを関連付けて整理する能力\n・ リスクを優先順位付けする能力"
  },
  {
    "large_category": "",
    "small_category": "1-3 情報セキュリティリスク対応",
    "overview": "",
    "required_knowledge": "情報セキュリティリスクアセスメントの結果に基づく適切な管理策の選定，情報セキュリティリスク対応計画の策定について，必要な指導・助言を行い，支援する。\n・ リスク対応の選択肢（リスク低減，リスク共有，リスク回避，リスク保有など）に関する知識\n・ 管理策の実施に要する費用の算定に関する知識\n・ サイバー保険に関する知識",
    "required_skill": "・ リスクごとに，リスク対応の選択肢を選定する能力\n・ リスク対応の実施に適切な管理策を選定する能力\n・ 情報セキュリティリスク対応計画を作成し，残留リスクと併せて説明する能力"
  },
  {
    "large_category": "",
    "small_category": "1-6 情報セキュリティに関する動向・事例の収集と分析",
    "overview": "",
    "required_knowledge": "1-6 情報セキュリティに関する動向・事例の収集と分析\n情報セキュリティに関する事件・事故，傾向と背景，攻撃の手口，脅威，脆弱性及び対策，セキュリティ技術などの情報を収集する。情報セキュリティに関する法令，規制，規格類の制定・改廃や社会通念の変化，コンプライアンス上の新たな課題などについて把握する。収集した各情報について，組織内への影響，対応の緊急性，対応の費用・効果・必要性を評価し，報告する。\n・ JIS，ISO，IEC，IEEE，NISTなどのセキュリティ関連の規格の動向に関する知識\n・ 業界標準，ガイドラインの動向に関する知識\n・ サイバー・フィジカル・セキュリティ対策フレームワーク（CPSF）に関する知識\n・ 攻撃の手口に関する知識\n・ 攻撃の分析モデル（サイバーキルチェーン，ATT＆CKなど）に関する知識\n・ 脅威インテリジェンス（OSINTなど）に関する知識",
    "required_skill": "・ 国内外の様々な情報源（公的機関，セキュリティ機関，ベンダからの発表，カンファレンス，論文など）から，必要な情報を，迅速にかつ継続的に収集する能力\n・ 収集した情報の信頼性，正確さを検証する能力\n・ 収集した情報を整理し，関係者に伝達する能力\n・ 収集した情報に関して，組織内への影響などを評価する能力"
  },
  {
    "large_category": "",
    "small_category": "1-6 情報セキュリティに関する動向・事例の収集と分析",
    "overview": "",
    "required_knowledge": "ィ要件の定義について，必要な指導・助言",
    "required_skill": ""
  },
  {
    "large_category": "",
    "small_category": "1-6 情報セキュリティに関する動向・事例の収集と分析",
    "overview": "",
    "required_knowledge": "て，セキュリティの観点から必要な指導・",
    "required_skill": ""
  },
  {
    "large_category": "",
    "small_category": "2-2 製品・サービスのセキュアな導入",
    "overview": "",
    "required_knowledge": "2-2 製品・サービスのセキュアな導入\nシステム全体又はその一部を構成する製品・サービスの調達について，セキュリティの観点から必要な指導・助言を行い，支援する。調達した製品・サービスへのセキュアな設定の実施について，必要な指導・助言を行い，支援する。\n・ 製品・サービスの種類と特徴に関する知識\n・ ネットワーク機器，サーバの設定に関する知識\n・ 要塞化（ハードニング）に関する知識\n・ セキュリティの投資対効果の評価に関する知識",
    "required_skill": "・ 製品・サービスの仕様書とセキュリティ要件とを照らして，製品・サービスを選定する能力\n・ セキュリティの投資対効果を最適化する能力"
  },
  {
    "large_category": "",
    "small_category": "2-3 アーキテクチャの設計（セキュリティ の観点）",
    "overview": "",
    "required_knowledge": "システム及びネットワークのアーキテクチャの設計，インタフェース，利用する各技術の評価について，セキュリティの観点から必要な指導・助言を行い，支援する。\n・ システム開発技術，アーキテクチャの設計に関する知識\n・ データベース，ネットワークに関する知識\n・ 信頼性設計（フェールセーフ，フェールソフトなど）に関する知識\n・ 仮想化，コンテナ技術に関する知識",
    "required_skill": "・ アーキテクチャの設計書をレビューする能力\n・ システム及びネットワークのアーキテクチャ，インタフェース，利用する各技術がセキュアであるかどうかを評価する能力"
  },
  {
    "large_category": "",
    "small_category": "2-6 セキュリティテスト",
    "overview": "",
    "required_knowledge": "実装したセキュリティ機能のテスト，並びにソフトウェア及びシステムのテストについて，セキュリティの観点から必要な指導・助言を行い，支援する。運用フェーズのソフトウェア及びシステムを対象に行う脆弱性診断について，必要な指導・助言を行い，支援する。\n・ ソフトウェア及びシステムの，セキュリティの観点でのテスト（ソースコード静的検査，プログラム動的検査，ファジングなど）の実施方法に関する知識\n・ 脆弱性診断，ペネトレーションテストの実施方法に関する知識\n・ 脆弱性検査ツール（Webアプリケーションソフトウェア検査用，ネットワーク検査用など）に関する知識",
    "required_skill": "・ テスト対象に応じて，必要なテストの種類及びその実施方法を計画する能力\n・ 実施するテストの種類に適したツールを選択する能力\n・ 手動テストとツールによる自動テストを組み合わせ，効果的かつ効率的なテストを計画する能力\n・ テストで検出したエラーを識別し，修正，解消する能力"
  },
  {
    "large_category": "",
    "small_category": "2-7 運用・保守（セキュリティ の観点）",
    "overview": "",
    "required_knowledge": "2-7 運用・保守（セキュリティ の観点）\nシステムの運用・保守について，セキュリティの観点から必要な指導・助言を行い，支援する。運用・保守の関連文書のレビュー，システム運用担当者に対する教育・訓練の実施について，セキュリティの観点から必要な指導・助言を行い，支援する。\n・ サービスマネジメント，ITSMS，SLAに関する知識\n・ サービスデスクに関する知識\n・ システム及びネットワークの監視手順，情報セキュリティインシデントが発生した場合の運用手順に関する知識",
    "required_skill": "・ 運用・保守の関連文書（作業計画書，作業手順書，利用者向けのマニュアルなど）を，セキュリティの観点からレビューする能力\n・ 運用担当者の能力水準の目標に合わせて教育・訓練の目標を設定する能力"
  },
  {
    "large_category": "",
    "small_category": "3-2 マルウェア対策",
    "overview": "",
    "required_knowledge": "情報及び情報システムをマルウェアから保護するためのマルウェア対策ソフト及び他のセキュリティソリューションの導入，運用（マルウェア定義ファイルの更新を含む），並びにマルウェア感染を防止するための諸規程の策定及び改定について，必要な指導・助言を行い，支援する。マルウェア感染の疑いがある事象の報告手順，初動対応手順の設計について，必要な指導・助言を行い，支援する。\n・ マルウェアの種類と特徴（ボット，ランサムウェア，ファイルレスマルウェアなど）に関する知識\n・ マルウェア感染の経路・方法（標的型攻撃など）に関する知識\n・ 既知及び未知のマルウェアを検知，隔離又は無害化する技術\n・ マルウェアによる攻撃（C＆C通信，ファイル暗号化など）に対する多層防御に関する知識\n・ 検疫ネットワーク，サンドボックスに関する知識",
    "required_skill": "・ マルウェア感染のリスクを分析する能力\n・ 情報システム，ネットワーク構成及びその利用方法に応じたマルウェア対策を設計する能力\n・ マルウェア対策ソフトを効果的に適用し，マルウェアからの保護の有効性を高める能力\n・ マルウェア感染の初動対応手順を設計する能力"
  },
  {
    "large_category": "",
    "small_category": "3-5 ネットワーク及び機器のセキュリティ管理",
    "overview": "",
    "required_knowledge": "ネットワーク及び通信（電子メールの送受信など）におけるセキュリティの確保について，必要な指導・助言を行い，支援する。ネットワークの管理手順及び利用手順並びに通信データの保護方法のレビューについて，必要な指導・助言を行い，支援する。利用者エンドポイント機器利用及びリモートワークにおけるセキュリティ対策について，必要な指導・助言を行い，支援する。\n・ ネットワーク通信プロトコル（DNS，ICMP，ARP，DHCP，HTTP，SMTPなど）に関する知識\n・ Webアクセスのセキュリティに関する知識\n・ 電子メールのセキュリティに関する知識\n・ DNSのセキュリティに関する知識\n・ 無線LANのセキュリティに関する知識\n・ ネットワークセキュリティ技術（ファイアウォール，IPS/IDS，WAFなど）に関する知識\n・ 利用者エンドポイント機器利用及びリモートワークのセキュリティ（物理的保護，遠隔でのデータ消去・ロック，VDIなど）に関する知識",
    "required_skill": "・ ネットワークの物理的又は論理的な分割を設計する能力\n・ 利用するネットワークサービスのセキュリティ（認証，暗号化，ネットワーク接続管理など），サービスレベルなどの妥当性を確認する能力"
  },
  {
    "large_category": "",
    "small_category": "3-8 アカウント管理及びアクセス管理",
    "overview": "",
    "required_knowledge": "情報及び情報システム並びにネットワークサービスのアクセス制御方針のレビューについて，必要な指導・助言を行い，支援する。アカウント管理，認証情報の割当て及び管理並びにアクセス管理に関するプロセスの確立，特権的アクセス権の割当て及び利用の制限と管理について，必要な指導・助言を行い，支援する。アカウント及びアクセス権のレビューについて，必要な指導・助言を行い，支援する。\n・ アクセス制御の種類と特徴（ロールベースアクセス制御など）に関する知識\n・ need-to-know，need-to-use，最小権限の原則に関する知識\n・ 認証情報の割当て及び管理に関する知識\n・ アカウント及びアクセス権のレビューが必要になるタイミング（利用者の異動，業務担当者の変更，雇用又は契約の終了など）に関する知識",
    "required_skill": "・ アクセス制御方針，アカウント及びアクセス権をレビューする能力\n・ 責任追跡性を確保するための，特権的アクセスのログの記録，保護及びレビューの手順を設計する能力\n・ 情報システムの重要性に応じた認証情報の割当て及び管理を設計する能力"
  },
  {
    "large_category": "",
    "small_category": "3-11 コンプライアンス管理",
    "overview": "",
    "required_knowledge": "情報セキュリティ及び個人情報保護に関連する法令，規制並びに契約上の義務を考慮した組織内の情報セキュリティ諸規程の策定及び改定について，必要な指導・助言を行い，支援する。また，法令，規制，契約に関する従業員向け意識向上プログラムの利用について，必要な指導・助言を行い，支援する。\n・ 法令（刑法，不正アクセス禁止法，個人情報保護法，マイナンバー法，不正競争防止法など）及び公的なガイドラインに関する知識\n・ 契約，倫理，公益通報者保護制度に関する知識\n・ 意識向上プログラムに関する知識",
    "required_skill": "・ 法令，規制などを考慮して，情報セキュリティ諸規程を策定し，改定する能力\n・ 契約上の義務を確実に遂行する方法を設計する能力\n・ コンプライアンス管理の重要性を関係者に伝達する手段を設計する能力"
  },
  {
    "large_category": "",
    "small_category": "4-1 情報セキュリティインシデントの管理体制の構築",
    "overview": "",
    "required_knowledge": "組織内CSIRTの構築について，必要な指導・助言を行い，支援する。情報セキュリティインシデントの管理に関する規程の策定及び改定について，必要な指導・助言を行い，支援する。\n・ CSIRTの構築（体制の構築，規程の整備，メンバの訓練など）に関する知識\n・ CSIRT活動の設備（執務スペース，通信設備，データの管理・廃棄のための設備，インシデントトラッキングシステムなど）に関する知識\n・ PSIRTに関する知識",
    "required_skill": "・ 情報セキュリティインシデントの管理に関する規程を検討する能力\n・ 情報セキュリティ事象を情報セキュリティインシデントとするかの判断基準，及び対応の優先順位の判断基準を設計する能力"
  },
  {
    "large_category": "",
    "small_category": "4-4 証拠の収集及び分析",
    "overview": "",
    "required_knowledge": "証拠保全の手順及びツールについて，必要な指導・助言を行い，支援する。専門性を必要とする状況における，デジタルフォレンジックスの専門家，法的措置の専門家などへの依頼について，必要な指導・助言を行い，支援する。\n・ 証拠保全すべき対象に関する知識\n・ 証拠保全の手順及びツールに関する知識\n・ Chain of Custody（証拠保全の一貫性）に関する知識\n・ 法的措置（弁護士又は警察への相談など）に関する知識",
    "required_skill": "・ 証拠保全の対象（デスクトップPC，ノートPC，サーバ，記憶媒体），電源の状態などに応じた証拠保全方法を設計する能力\n・ 証拠を分析する能力"
  }
]